# Задание 15: None

my_variable = None

print("None — это специальное значение в Python, которое обозначает 'ничего', 'пустоту', 'отсутствие значения'.")
print("Оно часто используется, когда переменная ещё не была инициализирована или когда функция ничего не возвращает.")


if my_variable is None:
    print("Переменная my_variable действительно равна None (сравнение через 'is')")
else:
    print("Переменная my_variable НЕ равна None")
